import React from "react";

const About = () => {
  return (
    <div className="cont bg-khakestar-100 rounded-3xl">
      <div className="p-5 mt-10">
        <h1 className="font-bold !text-3xl">درباره ما</h1>
        <p className="my-3 block leading-10 text-khakestar-300">
          من در حال طراحی رابط کاربری یک فروشگاه آنلاین موبایل هستم که با
          استفاده از React و Tailwind CSS توسعه داده‌ام. هدفم اینه که تجربه‌ای
          سریع، زیبا و کاربرپسند برای بازدیدکننده‌ها فراهم کنم؛ جوری که بتونن
          خیلی راحت گوشی موردنظرشون رو پیدا کنن. تمام صفحات سایت رو به‌شکل
          پاسخ‌گو و مینیمال طراحی کرده‌ام تا روی همه‌ی دستگاه‌ها، مخصوصاً
          موبایل، بدون مشکل اجرا بشه. در این پروژه، سعی کردم با رعایت اصول
          UI/UX، محیطی حرفه‌ای و جذاب ایجاد کنم تا کاربر از گشت‌و‌گذار در سایت
          لذت ببره. ظاهر مدرن و کدنویسی تمیز باعث می‌شه حس اعتماد و راحتی منتقل
          بشه. در حال حاضر فقط بخش فرانت‌اند فعاله و تمرکز اصلی من روی تست تجربه
          کاربری بوده. البته برنامه دارم در آینده بک‌اند سایت رو هم پیاده‌سازی
          کنم و قابلیت‌هایی مثل سبد خرید و پرداخت آنلاین رو بهش اضافه کنم. این
          پروژه برای من فرصتی بوده تا مهارت‌هام در React و Tailwind CSS رو
          به‌کار بگیرم، اون‌ها رو به‌چالش بکشم و دائماً بهترشون کنم. من عاشق
          یادگیری و ساختن تجربه‌های جدیدم و این فروشگاه یکی از مسیرهای رشد منه.
        </p>
      </div>
    </div>
  );
};

export default About;
